shomagan/stm32f103_base/src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V.
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other
  *    contributors to this software may be used to endorse or promote products
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under
  *    this license is void and will automatically terminate your rights under
  *    this license.
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/

#include "stm32f1xx_hal.h"
#include "cmsis_os.h"
#include "onewire.h"
#include "control.h"
#include "stm32f1xx_ll_gpio.h"
#include "step.h"
#include "main.h"
#include "tusbd_cdc.h"
#include "stm32f1xx_ll_tim.h"
#include "stm32f1xx_ll_rcc.h"
#include "stm32f1xx_ll_bus.h"
#include "stm32f1xx_ll_system.h"

#if STEP_BOARD
#include "step_board.h"
#endif

/* Private variables ---------------------------------------------------------*/
static ADC_HandleTypeDef hadc1;
IWDG_HandleTypeDef hiwdg;
RTC_HandleTypeDef hrtc;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
UART_HandleTypeDef huart1;
static osThreadId own_task_id;
sofi_vars_t sofi;
#if FEEDER
static osThreadId step_task_id;
#endif

#if STEP_BOARD
static osThreadId step_board_task_id;
#else
static osThreadId ds18_task_id,control_task_id;
#endif



/* Private function prototypes -----------------------------------------------*/

static void MX_GPIO_Init(void);
static void MX_IWDG_Init(void);
static void MX_RTC_Init(void);
static void MX_ADC1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void RTC_AlarmConfig(void);
static void cable_heat_gpio_init(void);
void own_task(void const * argument);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
u8 stop_mode = 0;
#define STORE_SPACE_ADDRESS_LD 0x800FC00
static CRC_HandleTypeDef hcrc;
stored_data_t stored_data;
/**
 * @brief read stored data from flash
 */
static void read_stored_flash(stored_data_t *stored_data){
    HAL_FLASH_Unlock();
    memcpy(stored_data->bytes,(void*)STORE_SPACE_ADDRESS_LD,FLASH_PAGE_SIZE);
    HAL_FLASH_Lock();
}
/**
 * @brief save_stored_struct
 * @param stored_data
 * @return none zero value if an error occured
 */
int save_stored_struct(stored_data_t *stored_data){
    FLASH_EraseInitTypeDef eraseInitStruct = {0};
    stored_data->stored_struct.flash_write_counter++;
    stored_data->stored_struct.crc = HAL_CRC_Calculate(&hcrc, (void*)stored_data->bytes, (sizeof(stored_struct_t)-4)/4);
    HAL_FLASH_Unlock();
    uint32_t PageError = 0;
    eraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
    eraseInitStruct.PageAddress = STORE_SPACE_ADDRESS_LD;
    eraseInitStruct.NbPages = 1;
    HAL_FLASHEx_Erase(&eraseInitStruct, &PageError);
    for (uint32_t i = 0; i < sizeof(stored_struct_t); i+=4){
        HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, STORE_SPACE_ADDRESS_LD + i, stored_data->bytes[i/4]);
    }
    HAL_FLASH_Lock();
    return 0;
}/**
 * @brief check_stored_struct
 * @param stored_data
 * @return 1 if stored 0- if crc mismatch <0 if error occured
 */
static int check_stored_struct(stored_data_t *stored_data){
    int res = 0;
    if (stored_data->stored_struct.size_of_table<FLASH_PAGE_SIZE){
        if(HAL_CRC_Calculate(&hcrc, (void*)stored_data->bytes, (stored_data->stored_struct.size_of_table) / 4)==0){
            u8 changed = 0;
            if (stored_data->stored_struct.temperature_min>30){
                stored_data->stored_struct.temperature_min = CABLE_HEAT_MIN_VALUE;
                changed =1;
            }
            if (stored_data->stored_struct.temperature_triger>50){
                stored_data->stored_struct.temperature_triger = CABLE_HEAT_TRIGGER;
                changed =1;
            }
            if (changed){
                save_stored_struct(stored_data);
            }
            res = 1;
        }
    }
    if (res !=1){
        //not compared
        stored_data->stored_struct.size_of_table = sizeof(stored_struct_t);
        stored_data->stored_struct.temperature_min = CABLE_HEAT_MIN_VALUE;
        stored_data->stored_struct.temperature_triger = CABLE_HEAT_TRIGGER;
        stored_data->stored_struct.flash_write_counter = 0;
        stored_data->stored_struct.last_flashed_unix_time = 0;
        stored_data->stored_struct.trigers_num = 0;
        res = save_stored_struct(stored_data);
    }
    return res;
}

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void){
    SystemClock_Config();
    HAL_Init();
    MX_GPIO_Init();
#if IWDG_USE
    MX_IWDG_Init();
#endif
#if RTC_USE
    MX_RTC_Init();
#endif
#if ADC_USE
    MX_ADC1_Init();
#endif
#if UART_USE
    MX_USART1_UART_Init();
#endif
#if CRC_USE
    hcrc.Instance = CRC;
    if (HAL_CRC_Init(&hcrc) != HAL_OK){

