shomagan/stm32f103_base/src/main.c
    }
#endif
#if STEP_BOARD==0
    MX_TIM3_Init();
#endif
#if CABLE_HEATING
    read_stored_flash(&stored_data);
    check_stored_struct(&stored_data);
    cable_heat_gpio_init();
#endif
    MX_TIM2_Init();
    osThreadDef(own_task, own_task, osPriorityNormal, 0, 364);
    own_task_id = osThreadCreate(osThread(own_task), NULL);

#if STEP_BOARD
    osThreadDef(car_step_board_task, car_step_board_task, osPriorityNormal, 0, 364);
    step_board_task_id = osThreadCreate(osThread(car_step_board_task), NULL);

#else
    #if FEEDER
        osThreadDef(step_task, step_task, osPriorityNormal, 0, 364);
        step_task_id = osThreadCreate(osThread(step_task), NULL);
    #endif
    osThreadDef(ds18_task, ds18_task, osPriorityNormal, 0, 364);
    ds18_task_id = osThreadCreate(osThread(ds18_task), NULL);
    #if CONTROL_TASK
        osThreadDef(control_task, control_task, osPriorityNormal, 0, 364);
        control_task_id = osThreadCreate(osThread(control_task), NULL);
    #endif
#endif
    /* Start scheduler */
    HAL_TIM_Base_Stop(&htim1);
    osKernelStart();
    while (1)  { }
}
void pre_sleep_proccess(){
    HAL_TIM_Base_Stop(&htim1);
}
void post_sleep_proccess(){
    HAL_TIM_Base_Start(&htim1);
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void){
    RCC_OscInitTypeDef RCC_OscInitStruct;
    RCC_ClkInitTypeDef RCC_ClkInitStruct;
    /**Initializes the CPU, AHB and APB busses clocks*/

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE|RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_LSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.LSIState = RCC_LSI_ON;
#if RTC_USE
    RCC_OscInitStruct.LSEState = RCC_LSE_ON;
#else
    RCC_OscInitStruct.LSEState = RCC_LSE_OFF;
#endif

    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL6;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }
    /**Initializes the CPU, AHB and APB busses clocks   */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
            |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }
    RCC_PeriphCLKInitTypeDef PeriphClkInit;
    PeriphClkInit.PeriphClockSelection =0;
    PeriphClkInit.PeriphClockSelection |=
#if USB_USE
            RCC_PERIPHCLK_USB|
    #if ADC_USE
            RCC_PERIPHCLK_ADC|
    #endif
#else
    #if ADC_USE
            RCC_PERIPHCLK_ADC|
    #endif
#endif
    0;
#if ADC_USE
    PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV6;
#endif
#if USB_USE
    PeriphClkInit.UsbClockSelection = RCC_USBCLKSOURCE_PLL;
#endif
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }
    /**Configure the Systick interrupt time*/
    HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);
    /**Configure the Systick*/
    HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);
    /* SysTick_IRQn interrupt configuration */
    HAL_NVIC_SetPriority(SysTick_IRQn, 8, 0);
}
__STATIC_INLINE void SYSCLKConfig_FromSTOP(void){
  /* Customize process using LL interface to improve the performance
     (wake-up time from STOP quicker in LL than HAL)*/
  /* HSE configuration and activation */
  LL_RCC_HSI_Enable();
  while(LL_RCC_HSI_IsReady() != 1) {}
  LL_RCC_LSI_Enable();
  while(LL_RCC_LSI_IsReady() != 1) {}
  /* Main PLL activation */
  LL_RCC_PLL_Enable();
  while(LL_RCC_PLL_IsReady() != 1) {}
  /* SYSCLK activation on the main PLL */
  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_PLL);
  while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_PLL){}
  HAL_RTCEx_SetSecond_IT(&hrtc);
  HAL_NVIC_SetPriority(RTC_IRQn, 12, 0);
  HAL_NVIC_EnableIRQ(RTC_IRQn);

}

/* ADC1 init function */
static void MX_ADC1_Init(void){
    ADC_ChannelConfTypeDef sConfig;
    ADC_InjectionConfTypeDef sConfigInjected;
    /**Common config*/
    hadc1.Instance = ADC1;
    hadc1.Init.ScanConvMode = ADC_SCAN_ENABLE;
    hadc1.Init.ContinuousConvMode = DISABLE;
    hadc1.Init.DiscontinuousConvMode = ENABLE;
    hadc1.Init.NbrOfDiscConversion = 1;
    hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hadc1.Init.NbrOfConversion = 1;
    if (HAL_ADC_Init(&hadc1) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Configure Regular Channel*/
    sConfig.Channel = ADC_CHANNEL_0;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;
    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Configure Injected Channel*/
    /*common*/
    sConfigInjected.InjectedChannel = ADC_CHANNEL_0;
    sConfigInjected.InjectedNbrOfConversion = 4;
    sConfigInjected.InjectedSamplingTime = ADC_SAMPLETIME_239CYCLES_5;
    sConfigInjected.ExternalTrigInjecConv = ADC_INJECTED_SOFTWARE_START;
    sConfigInjected.AutoInjectedConv = DISABLE;
    sConfigInjected.InjectedDiscontinuousConvMode = ENABLE;
    sConfigInjected.InjectedOffset = 0;
    /*specific*/
    sConfigInjected.InjectedRank = ADC_INJECTED_RANK_1;
    if (HAL_ADCEx_InjectedConfigChannel(&hadc1, &sConfigInjected) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Configure Injected Channel*/
    sConfigInjected.InjectedRank = ADC_INJECTED_RANK_2;
    if (HAL_ADCEx_InjectedConfigChannel(&hadc1, &sConfigInjected) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Configure Injected Channel*/
    sConfigInjected.InjectedRank = ADC_INJECTED_RANK_3;
    if (HAL_ADCEx_InjectedConfigChannel(&hadc1, &sConfigInjected) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Configure Injected Channel*/
    sConfigInjected.InjectedRank = ADC_INJECTED_RANK_4;
    if (HAL_ADCEx_InjectedConfigChannel(&hadc1, &sConfigInjected) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }
}

