shomagan/stm32f103_base/src/main.c
/* IWDG init function */
static void MX_IWDG_Init(void){
    hiwdg.Instance = IWDG;
    hiwdg.Init.Prescaler = IWDG_PRESCALER_256;
    hiwdg.Init.Reload = 4095;
    if (HAL_IWDG_Init(&hiwdg) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }
}

/* RTC init function */
static void MX_RTC_Init(void){
    RTC_TimeTypeDef sTime;
    RCC_PeriphCLKInitTypeDef PeriphClkInit;
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
    PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }
    __HAL_RCC_PWR_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    __HAL_RCC_BKP_CLK_ENABLE();
    __HAL_RCC_RTC_ENABLE();
    hrtc.Instance = RTC;
    hrtc.Init.AsynchPrediv = RTC_AUTO_1_SECOND;
    if (HAL_RTC_Init(&hrtc) != HAL_OK) {
        _Error_Handler(__FILE__, __LINE__);
    }
    HAL_RTC_GetTime(&hrtc,&sTime,RTC_FORMAT_BIN);
    u32 data;
    const  u32 data_c = 0x1234;
    data = BKP->DR1;
    if(data!=data_c){
        BKP->DR1 = data_c;
        sTime.Hours = 14;
        sTime.Minutes = 5;
        sTime.Seconds = 0;
        if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK) {
            _Error_Handler(__FILE__, __LINE__);
        }
    }
    data = BKP->DR1;
    HAL_NVIC_SetPriority(RTC_Alarm_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(RTC_Alarm_IRQn);
    RTC_AlarmConfig();
}
static void RTC_AlarmConfig(void){
  RTC_AlarmTypeDef salarmstructure = {{0}, 0};
  RTC_TimeTypeDef sTime;
  HAL_RTC_GetTime(&hrtc,&sTime,RTC_FORMAT_BIN);
  if (sTime.Seconds>=58){
      sTime.Seconds = 0;
      if(sTime.Minutes == 59){
          sTime.Minutes = 0;
          if(sTime.Hours == 23){
             sTime.Hours = 0;
          }else{
             sTime.Hours += 1;
          }
      }else{
          sTime.Minutes += 1;
      }
  }else{
      sTime.Seconds+=2;
  }

  /*##-3- Configure the RTC Alarm peripheral #################################*/
  /* Set Alarm to 00:00:10
     RTC Alarm Generation: Alarm on Hours, Minutes and Seconds */
  salarmstructure.Alarm = RTC_ALARM_A;
  salarmstructure.AlarmTime.Hours = sTime.Hours;
  salarmstructure.AlarmTime.Minutes = sTime.Minutes;
  salarmstructure.AlarmTime.Seconds = sTime.Seconds;
  if(HAL_RTC_SetAlarm_IT(&hrtc,&salarmstructure,RTC_FORMAT_BIN) != HAL_OK){
    /* Initialization Error */
    Error_Handler();
  }
}
void HAL_RTC_AlarmAEventCallback(RTC_HandleTypeDef *hrtc){
    (void)hrtc;
    RTC_AlarmConfig();
}
/* TIM3 init function */
static void MX_TIM3_Init(void){
    TIM_ClockConfigTypeDef sClockSourceConfig = {0};
    TIM_MasterConfigTypeDef sMasterConfig;
    TIM_OC_InitTypeDef pwm_handle;
    htim3.Instance = TIM3;
    htim3.Init.Prescaler = 0;
    htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim3.Init.Period = MAX_PWM_VALUE;
    htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
    if (HAL_TIM_Base_Init(&htim3) != HAL_OK)  {
        _Error_Handler(__FILE__, __LINE__);
    }
    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    if (HAL_TIM_ConfigClockSource(&htim3, &sClockSourceConfig) != HAL_OK)  {
        _Error_Handler(__FILE__, __LINE__);
    }
    if (HAL_TIM_PWM_Init(&htim3) != HAL_OK)  {
        _Error_Handler(__FILE__, __LINE__);
    }
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig) != HAL_OK)  {
        _Error_Handler(__FILE__, __LINE__);
    }
    pwm_handle.OCMode = TIM_OCMODE_PWM1;
    pwm_handle.Pulse = 1000;
    pwm_handle.OCPolarity = TIM_OCPOLARITY_HIGH;
    pwm_handle.OCFastMode = TIM_OCFAST_DISABLE;
    if (HAL_TIM_PWM_ConfigChannel(&htim3, &pwm_handle, TIM_CHANNEL_1) != HAL_OK)  {
        _Error_Handler(__FILE__, __LINE__);
    }
    HAL_TIM_MspPostInit(&htim3);
}


/* USART1 init function */
static void MX_USART1_UART_Init(void){
    huart1.Instance = USART1;
    huart1.Init.BaudRate = 115200;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    if (HAL_UART_Init(&huart1) != HAL_OK)
    {
        _Error_Handler(__FILE__, __LINE__);
    }

}

/** Configure pins as 
        * Analog
        * Input
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void){
    /* GPIO Ports Clock Enable */
#if USE_GPIO_PORT_C
    __HAL_RCC_GPIOC_CLK_ENABLE();
#endif
#if USE_GPIO_PORT_D
    __HAL_RCC_GPIOD_CLK_ENABLE();
#endif
#if USE_GPIO_PORT_A
    __HAL_RCC_GPIOA_CLK_ENABLE();
#endif
#if USE_GPIO_PORT_B
    __HAL_RCC_GPIOB_CLK_ENABLE();
#endif
#if STEP_BOARD
    LL_GPIO_SetPinMode(DRV_STEP0_PORT, DRV_STEP0_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(DRV_STEP0_PORT, DRV_STEP0_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetOutputPin(DRV_STEP0_PORT, DRV_STEP0_LL);
    LL_GPIO_SetPinMode(DRV_DIR0_PORT, DRV_DIR0_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(DRV_DIR0_PORT, DRV_DIR0_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetOutputPin(DRV_DIR0_PORT, DRV_DIR0_LL);
    LL_GPIO_SetPinMode(DRV_STEP1_PORT, DRV_STEP1_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(DRV_STEP1_PORT, DRV_STEP1_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetOutputPin(DRV_STEP1_PORT, DRV_STEP1_LL);
    LL_GPIO_SetPinMode(DRV_DIR1_PORT, DRV_DIR1_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(DRV_DIR1_PORT, DRV_DIR1_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_ResetOutputPin(DRV_DIR1_PORT, DRV_DIR1_LL);

/*portb*/
    LL_GPIO_SetPinMode(DRV_SLIP_PORT, DRV_SLIP_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(DRV_SLIP_PORT, DRV_SLIP_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetOutputPin(DRV_SLIP_PORT, DRV_SLIP_LL);

    LL_GPIO_SetPinMode(DRV_RST_PORT, DRV_RST_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(DRV_RST_PORT, DRV_RST_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetOutputPin(DRV_RST_PORT, DRV_RST_LL);

    LL_GPIO_SetPinMode(DRV_FLT_PORT, DRV_FLT_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(DRV_FLT_PORT, DRV_FLT_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetOutputPin(DRV_FLT_PORT, DRV_FLT_LL);

    LL_GPIO_SetPinMode(DRV_EN_PORT, DRV_EN_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(DRV_EN_PORT, DRV_EN_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetOutputPin(DRV_EN_PORT, DRV_EN_LL);
    LL_GPIO_SetPinMode(LED_PORT, LED_PIN, LL_GPIO_MODE_OUTPUT);
#if CAR_KIDS
    GPIO_InitTypeDef	gpinit;
    gpinit.Mode = GPIO_MODE_INPUT;
    gpinit.Pull = GPIO_PULLUP;
    gpinit.Speed = GPIO_SPEED_FREQ_MEDIUM;
    gpinit.Pin = CAR_DIRECTION_IN_HAL;
    HAL_GPIO_Init(CAR_DIRECTION_IN_PORT,&gpinit);
    gpinit.Pin = CAR_SPEED_IN_HAL;
    HAL_GPIO_Init(CAR_SPEED_IN_PORT,&gpinit);
    gpinit.Pin = CAR_ENGINE_IN_HAL;
    HAL_GPIO_Init(CAR_ENGINE_IN_PORT,&gpinit);

    LL_GPIO_SetPinMode(CAR_DIRECTION_OUT_PORT, CAR_DIRECTION_OUT_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(CAR_DIRECTION_OUT_PORT, CAR_DIRECTION_OUT_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_ResetOutputPin(CAR_DIRECTION_OUT_PORT, CAR_DIRECTION_OUT_LL);
    LL_GPIO_SetPinMode(CAR_SPEED_OUT_PORT, CAR_SPEED_OUT_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(CAR_SPEED_OUT_PORT, CAR_SPEED_OUT_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_ResetOutputPin(CAR_SPEED_OUT_PORT, CAR_SPEED_OUT_LL);
    LL_GPIO_SetPinMode(CAR_ENGINE_OUT_PORT, CAR_ENGINE_OUT_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(CAR_ENGINE_OUT_PORT, CAR_ENGINE_OUT_LL, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_ResetOutputPin(CAR_ENGINE_OUT_PORT, CAR_ENGINE_OUT_LL);

#endif

#else
    LL_GPIO_SetPinMode(AIR_PORT, AIR_PIN, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinMode(FLOW_PORT, FLOW_PIN, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinMode(LIGTH1_PORT, LIGTH1_PIN, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinMode(LIGTH2_PORT, LIGTH2_PIN, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinMode(LED_PORT, LED_PIN, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinMode(STEP_PORT, STEP_OUT1_1, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(STEP_PORT, STEP_OUT1_1,LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetPinMode(STEP_PORT, STEP_OUT1_2, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(STEP_PORT, STEP_OUT1_2,LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetPinMode(STEP_PORT, STEP_OUT2_1, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(STEP_PORT, STEP_OUT2_1,LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetPinMode(STEP_PORT, STEP_OUT2_2, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(STEP_PORT, STEP_OUT2_2,LL_GPIO_OUTPUT_PUSHPULL);
#endif
    /*DS18b20 sensor*/
    LL_GPIO_SetPinMode(DS18B20_GPIO, DS18B20_PIN_LL, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_SetPinOutputType(DS18B20_GPIO, DS18B20_PIN_LL, LL_GPIO_OUTPUT_OPENDRAIN);
    LL_GPIO_SetOutputPin(DS18B20_GPIO, DS18B20_PIN_LL);
}
#if USB_USE
// The CDC recv buffer size should equal to the out endpoint size
// or we will need a timeout to flush the recv buffer
#define CDC_RX_EP_SIZE    32
static __ALIGN_BEGIN uint8_t cdc_buf[CDC_RX_EP_SIZE] __ALIGN_END;

int cdc_recv_data(tusb_cdc_device_t* cdc, const void* data, uint16_t len);
int cdc_send_done(tusb_cdc_device_t* cdc);
void cdc_line_coding_change(tusb_cdc_device_t* cdc);

static tusb_cdc_device_t cdc_dev = {
  .backend = &cdc_device_backend,
  .ep_in = 1,
  .ep_out = 1,
  .ep_int = 8,
  .on_recv_data = cdc_recv_data,
  .on_send_done = cdc_send_done,
  .on_line_coding_change = cdc_line_coding_change,
  .rx_buf = cdc_buf,
  .rx_size = sizeof(cdc_buf),
};
static int cdc_len = 0;
void cdc_line_coding_change(tusb_cdc_device_t* cdc){
  // TODO, handle the line coding change
  //cdc->line_coding.bitrate;
  //cdc->line_coding.databits;
  //cdc->line_coding.stopbits;
  //cdc->line_coding.parity;
}

int cdc_recv_data(tusb_cdc_device_t* cdc, const void* data, uint16_t len){
    cdc_len = (int)len;
    return 1; // return 1 means the recv buffer is busy
}

