shomagan/stm32f103_base/src/main.c
int cdc_send_done(tusb_cdc_device_t* cdc){
    tusb_set_rx_valid(cdc->dev, cdc->ep_out);
    return 0;
}
// make sure the interface order is same in "composite_desc.lua"
static tusb_device_interface_t* device_interfaces[] = {
    (tusb_device_interface_t*)&cdc_dev, 0,   // CDC need two interfaces
};

static void init_ep(tusb_device_t* dev){
    CDC_ACM_TUSB_INIT(dev);
}
void tusb_delay_ms(uint32_t ms){
    osDelay(ms);
}


static tusb_device_config_t device_config = {
    .if_count = sizeof(device_interfaces)/sizeof(device_interfaces[0]),
    .interfaces = &device_interfaces[0],
    .ep_init = init_ep,
};
#endif
/* StartDefaultTask function */
static u32 test1 = 0;
void own_task(void const * argument){
    (void)argument;
#if IWDG_USE
    HAL_IWDG_Refresh(&hiwdg);
#endif
#if USB_USE
    tusb_device_t* dev = tusb_get_device(TEST_APP_USB_CORE);
    tusb_set_device_config(dev, &device_config);
    tusb_open_device(dev);
#endif

    while(1){
#if IWDG_USE
        HAL_IWDG_Refresh(&hiwdg);
#endif
/*        __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);
        HAL_SuspendTick();
        EXTI->PR = 0xFFFFFFFF;
        HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFE);
        SYSCLKConfig_FromSTOP();
        HAL_ResumeTick();
        test1++;*/
        LL_GPIO_TogglePin(LED_PORT, LED_PIN);
#if USB_USE
        if(cdc_len==4){
            if (cdc_buf[0]==0xee && cdc_buf[3]==0xee){
                u8 ch = 0xaa;
                if (cdc_buf[1]<30){
                    stored_data.stored_struct.temperature_min = cdc_buf[1];
                }
                if (cdc_buf[2]<50){
                    stored_data.stored_struct.temperature_triger = cdc_buf[2];
                }
                tusb_cdc_device_send(&cdc_dev, &ch, 1);
                save_stored_struct(&stored_data);
            }else{
                u8 ch = 0xbb;
                tusb_cdc_device_send(&cdc_dev, &ch, 1);
            }

            cdc_len = 0;
        }
#endif
        osDelay(1000);
    }
}



/* TIM2 init function */
static void MX_TIM2_Init(void){
    TIM_ClockConfigTypeDef sClockSourceConfig={0};
    TIM_MasterConfigTypeDef sMasterConfig={0};
    htim2.Instance = TIM2;
    htim2.Init.Prescaler = (((HAL_RCC_GetPCLK2Freq())/ 1000000) - 1);//63
    htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim2.Init.Period = 0xffff;
    htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_Base_Init(&htim2) != HAL_OK)  {
        _Error_Handler(__FILE__, __LINE__);
    }
    sClockSourceConfig.ClockFilter = 0;
    sClockSourceConfig.ClockPrescaler = 0;
    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    sClockSourceConfig.ClockPolarity = TIM_CLOCKPOLARITY_NONINVERTED;
    if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK)  {
        _Error_Handler(__FILE__, __LINE__);
    }
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)  {
        _Error_Handler(__FILE__, __LINE__);
    }
    return;
}


/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){
    if (htim->Instance == TIM1) {
        HAL_IncTick();
    }
}
static void cable_heat_gpio_init(){
    /**TIM3 GPIO Configuration PA6------> TIM3_CH1*/
    GPIO_InitTypeDef GPIO_InitStruct;
    GPIO_InitStruct.Pin = PID_OUT_PIN_HAL_0;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(PID_OUT_PORT_0, &GPIO_InitStruct);
    LL_GPIO_ResetOutputPin(PID_OUT_PORT_0, PID_OUT_PIN_LL_0);
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line){
    while(1){
    }
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line){ 
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

